In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r'C:\Users\Satyam\Downloads\CAR DETAILS FROM CAR DEKHO.csv')

In [14]:
# columns
# null value
# head
# tail
# sample
# info
# describe
# corr

# 1. Name the car which is having the selling price more than 600000.

df[df['selling_price']>600000][['name','year','selling_price']]

                                    name  year  selling_price
8               Hyundai Creta 1.6 VTVT S  2015         850000
12       Toyota Corolla Altis 1.8 VL CVT  2018        1650000
21              Hyundai Creta 1.6 VTVT S  2015         850000
25       Toyota Corolla Altis 1.8 VL CVT  2018        1650000
27           Hyundai Venue SX Opt Diesel  2019        1195000
...                                  ...   ...            ...
4311             Toyota Camry Hybrid 2.5  2017        1900000
4312               Maruti Ertiga 1.5 VDI  2019        1000000
4313  Ford Endeavour 2.2 Titanium AT 4X2  2019        2800000
4332        Mahindra Scorpio S2 7 Seater  2015         750000
4338    Hyundai Creta 1.6 CRDi SX Option  2016         865000

[1057 rows x 3 columns]

In [10]:
df.shape

(4340, 8)

In [18]:
# Name the car having manual transmission and also find how much km its driven.

df[df['transmission'] == 'Manual'][['name','km_driven']]

                                     name  km_driven
0                           Maruti 800 AC      70000
1                Maruti Wagon R LXI Minor      50000
2                    Hyundai Verna 1.6 SX     100000
3                  Datsun RediGO T Option      46000
4                   Honda Amaze VX i-DTEC     141000
...                                   ...        ...
4335  Hyundai i20 Magna 1.4 CRDi (Diesel)      80000
4336           Hyundai i20 Magna 1.4 CRDi      80000
4337                  Maruti 800 AC BSIII      83000
4338     Hyundai Creta 1.6 CRDi SX Option      90000
4339                     Renault KWID RXT      40000

[3892 rows x 2 columns]

In [20]:
#  Name the list of the car having sold by first owner.
df[df['owner']=='First Owner']['name']

0                                      Maruti 800 AC
1                           Maruti Wagon R LXI Minor
2                               Hyundai Verna 1.6 SX
3                             Datsun RediGO T Option
5                               Maruti Alto LX BSIII
                            ...
4324                            Maruti Alto 800 Base
4332                    Mahindra Scorpio S2 7 Seater
4334    Toyota Innova 2.5 VX (Diesel) 8 Seater BS IV
4338                Hyundai Creta 1.6 CRDi SX Option
4339                                Renault KWID RXT
Name: name, Length: 2832, dtype: object

In [34]:
#  Name the list of car having selling price more than 10lac but manufacturing
# year will be 2010.

df[(df['selling_price'] > 1000000) & (df['year']== 2010)]

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
163,Jaguar XJ 5.0 L V8 Supercharged,2010,2550000,40000,Petrol,Individual,Automatic,Second Owner
2685,Audi Q5 2.0 TFSI Quattro,2010,1100000,110000,Petrol,Individual,Automatic,First Owner
3782,Toyota Fortuner 3.0 Diesel,2010,1250000,205000,Diesel,Individual,Manual,Second Owner
3875,Land Rover Range Rover 4.4 Diesel LWB Vogue SE,2010,4200000,100000,Diesel,Dealer,Automatic,First Owner

In [28]:
# most expensive car
df['selling_price'].max()

8900000

In [35]:
d['selling_price']== df['selling_price'].max()]

0       False
1       False
2       False
3       False
4       False
        ...
4335    False
4336    False
4337    False
4338    False
4339    False
Name: selling_price, Length: 4340, dtype: bool

In [37]:
df[df['selling_price']== df['selling_price'].max()]['name']

3872    Audi RS7 2015-2019 Sportback Performance
Name: name, dtype: object